content/posts/abaunza2017.md
+++
title = "abaunza2017 | Dual Quaternion Modeling and Control of a Quad-rotor Aerial Manipulator"
author = ["João Gutemberg Farias"]
draft = false
+++

The work presents modeling and control of a quadcopter with an robotic arm attached, forming a aerial manipulator. Both modeling and control uses dual quaternions.
The work is very similar to <sup id="c5131fa61eb5d7177d4fdf0d017a8cb7"><a href="#abaunza_quadrotor_2016" title="Abaunza, Castillo, Lozano \&amp; Victorino, Quadrotor Aerial Manipulator Based on Dual Quaternions, 152--161, in in: {Unmanned {{Aircraft Systems}} ({{ICUAS}}), 2016 {{International Conference}} On}, edited by {IEEE} (2016)">abaunza_quadrotor_2016</a></sup> (same authors)


## Info {#info}

This contribution presents a modeling technique for an aerial manipulator based on a quad-rotor vehicle provided with a robotic arm. Dual quaternions, which are a little explored but powerful mathematical tool, are proposed as an alternative to the classical Euler angles approach for the kinematic and dynamic modeling. A feedback control law based on dual quaternions is used to validate the proposed model, taking into account the external effects of the robotic limb. Numerical simulations and experiments validate the proposal, opening a path for future research.


## Notes {#notes}


### Resumo {#resumo}

Trabalho muito similar a <sup id="c5131fa61eb5d7177d4fdf0d017a8cb7"><a href="#abaunza_quadrotor_2016" title="Abaunza, Castillo, Lozano \&amp; Victorino, Quadrotor Aerial Manipulator Based on Dual Quaternions, 152--161, in in: {Unmanned {{Aircraft Systems}} ({{ICUAS}}), 2016 {{International Conference}} On}, edited by {IEEE} (2016)">abaunza_quadrotor_2016</a></sup> (inclusive são os mesmos autores).
O trabalho apresenta a modelagem e controle de um quadcoptero com um braço acoplado usando quatérnios duais.
